In [ ]:
# https://youtu.be/8gGNXQgCmIE?si=NETH_JUZNOdWdOf3
# https://youtu.be/FXKMmilL70w?si=ZppZlY8w9rQBOELW

# Series and DataFrames

In [3]:
import numpy as np
import pandas as pd

In [5]:
t = [1, 2, 3, 4, 5]
ts = pd.Series(t)
ts

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
days = ['Mon', 'Tue', 'Wed', 'Thu', 'Fri']
ts = pd.Series(t, index=days)
ts

Mon    1
Tue    2
Wed    3
Thu    4
Fri    5
dtype: int64

In [8]:
fruits = {'apple': 10, 'banana': 15, 'cherry': 20}
fs = pd.Series(fruits)
fs

apple     10
banana    15
cherry    20
dtype: int64

In [9]:
data = {'Name': ['John', 'Mary', 'Lily'], 'Age': [24, 30, 29]}
df1 = pd.DataFrame(data)
df1

   Name  Age
0  John   24
1  Mary   30
2  Lily   29

In [28]:
data2 = [
    {'Name': 'John', 'Age': 24},
    {'Name': 'John1', 'Age': 28},
    {'Name': 'John2', 'Age': 27}
]
df2 = pd.DataFrame(data2)
df2

    Name  Age
0   John   24
1  John1   28
2  John2   27

In [29]:
age = df2['Age']
age

0    24
1    28
2    27
Name: Age, dtype: int64

In [30]:
df2['Age'] = [1, 2, 3]
df2

    Name  Age
0   John    1
1  John1    2
2  John2    3

In [31]:
df2.loc[0]

Name    John
Age        1
Name: 0, dtype: object

In [32]:
df2 = df2.drop('Age', axis=1)
df2

    Name
0   John
1  John1
2  John2

Name    John
Name: 0, dtype: object

# Indexing and Filtering

In [35]:
student_data = {
    'Name': ['John', 'Mary', 'Lily', 'Sue'],
    'Math': [85, 92, 78, 88],
    'Science': [91, 89, 84, 85],
    'English': [79, 85, 87, 90]
}

df = pd.DataFrame(student_data, index=['a', 'b', 'c', 'd'])
df

   Name  Math  Science  English
a  John    85       91       79
b  Mary    92       89       85
c  Lily    78       84       87
d   Sue    88       85       90

### Selecting Columns

In [36]:
df['Math']

a    85
b    92
c    78
d    88
Name: Math, dtype: int64

In [37]:
df[['Math', 'English']]

   Math  English
a    85       79
b    92       85
c    78       87
d    88       90

### Selecting Rows

In [38]:
df[0:2]

   Name  Math  Science  English
a  John    85       91       79
b  Mary    92       89       85

In [39]:
df.loc['a']

Name       John
Math         85
Science      91
English      79
Name: a, dtype: object

In [40]:
df.loc[['a', 'c']]

   Name  Math  Science  English
a  John    85       91       79
c  Lily    78       84       87

In [42]:
df.loc['a': 'c']

   Name  Math  Science  English
a  John    85       91       79
b  Mary    92       89       85
c  Lily    78       84       87

In [43]:
df.iloc[1:3]

   Name  Math  Science  English
b  Mary    92       89       85
c  Lily    78       84       87

### Selecting Rows and Columns

In [45]:
df.loc['a':'c', ['Math', 'English']]

   Math  English
a    85       79
b    92       85
c    78       87

In [47]:
df.iloc[2:3, [3]]

   English
c       87

### Filtering

In [49]:
df['Math'] > 80

a     True
b     True
c    False
d     True
Name: Math, dtype: bool

In [50]:
df[df['Math'] > 80]

   Name  Math  Science  English
a  John    85       91       79
b  Mary    92       89       85
d   Sue    88       85       90

In [51]:
df[(df['Math'] > 80) & (df['English'] > 90) | (df['Science']) < 100]

   Name  Math  Science  English
a  John    85       91       79
b  Mary    92       89       85
c  Lily    78       84       87
d   Sue    88       85       90

In [54]:
df[df['Name'].isin(['Sue'])]

  Name  Math  Science  English
d  Sue    88       85       90

In [58]:
df.where(df['Math'] < 90, 42)

   Name  Math  Science  English
a  John    85       91       79
b    42    42       42       42
c  Lily    78       84       87
d   Sue    88       85       90